[
  {
    "idiom": "一成不变",
    "definition": "(idiom) immutable;  impervious to change;  set in stone",
    "context": "When a person, system, or approach remains rigid and unchanging despite evolving circumstances or new opportunities, regardless of the potential benefits of adaptation. This often refers to a refusal to embrace progress, innovation, or necessary adjustments, maintaining old methods or beliefs steadfastly over time. It typically highlights a lack of flexibility or an unwillingness to reconsider long-held views or practices."
  },
  {
    "idiom": "铁面无私",
    "definition": "strictly impartial and incorruptible (idiom)",
    "context": "When an authority figure or institution enforces rules or laws without personal bias, favoritism, or emotional interference. This often describes someone who upholds justice or discipline strictly, even when it may be personally inconvenient or unpopular. It applies in any scenario where fairness and impartiality are prioritized over relationships or self-interest."
  },
  {
    "idiom": "七零八碎",
    "definition": "bits and pieces; scattered fragments",
    "context": "When information, objects, or ideas are scattered, incomplete, and lacking organization, making it difficult to form a clear or whole understanding. This often occurs when something has been broken down into many small parts or when efforts are disorganized and fragmented. It reflects a state of disorder where elements are not unified or systematically arranged."
  },
  {
    "idiom": "地久天长",
    "definition": "enduring while the world lasts (idiom, from Laozi);  eternal; for ever and ever (of friendship, hate etc); also written 天長地久|天长地久",
    "context": "When a relationship, feeling, or condition is expected to last indefinitely, transcending time and enduring through all circumstances, this expression is used. It often emphasizes the timeless and unchanging nature of deep emotions or commitments, such as love, loyalty, or enmity. It may also be used poetically or metaphorically to describe anything of lasting, seemingly eternal significance."
  },
  {
    "idiom": "面面相觑",
    "definition": "to look at each other in dismay (idiom)",
    "context": "When a group of people are caught off guard by an unexpected or awkward situation and are unsure how to respond, they may exchange puzzled or anxious glances. This often happens in moments of confusion, embarrassment, or when no one wants to take responsibility or speak up. It reflects a shared sense of uncertainty or discomfort without clear direction."
  },
  {
    "idiom": "头昏眼花",
    "definition": "to faint with blurred vision (idiom);  dizzy and eyes dimmed",
    "context": "When someone experiences intense physical fatigue, dizziness, or disorientation due to illness, exhaustion, or overwhelming circumstances, causing them to feel unsteady and lose clarity. It often describes moments when the body and mind are pushed beyond their limits, leading to a temporary loss of focus and coordination. This can occur in various contexts, such as prolonged physical strain, emotional distress, or sensory overload."
  },
  {
    "idiom": "拖泥带水",
    "definition": "lit. wading in mud and water; a slovenly job; sloppy",
    "context": "When someone fails to act decisively or with clarity, leading to unnecessary complications or delays. It often describes situations where actions are muddled, indecisive, or overly entangled with irrelevant details, resulting in inefficiency or confusion. This can apply to decision-making, communication, or task execution in both personal and professional settings."
  },
  {
    "idiom": "德才兼备",
    "definition": "having both integrity and talent (idiom)",
    "context": "When an individual demonstrates strong moral character along with exceptional abilities, this phrase is used to highlight their well-rounded excellence. It typically applies in contexts where both ethical behavior and competence are valued, such as in leadership, professional settings, or personal development. It emphasizes the ideal balance between virtue and skill in a person."
  },
  {
    "idiom": "梨花带雨",
    "definition": "lit. like raindrops on a pear blossom (idiom); fig. tear-stained face of a beauty",
    "context": "When a person, often of great beauty or grace, displays a mix of sorrow and delicate elegance, their appearance evokes a sense of poignant loveliness. This can apply in emotional or dramatic moments where vulnerability and beauty are intertwined, emphasizing a touching, almost ethereal, quality in their expression or demeanor."
  },
  {
    "idiom": "不在话下",
    "definition": "to be nothing difficult; to be a cinch",
    "context": "When a task or challenge is considered so simple or manageable that it does not warrant discussion or concern, regardless of the context. It applies when someone is confident in their ability to handle a situation easily, often downplaying its difficulty to emphasize competence or assurance."
  },
  {
    "idiom": "全民皆兵",
    "definition": "to bring the entire nation to arms (idiom)",
    "context": "When a society is mobilized for widespread participation in defense or resistance, especially during times of crisis or external threat. It describes a scenario where every citizen is prepared to take an active role in protecting their community or nation. This often reflects a state of heightened unity and readiness in the face of looming danger or conflict."
  },
  {
    "idiom": "藏垢纳污",
    "definition": "to hide dirt, to conceal corruption (idiom);  to shelter evil people and accept wrongdoing; aiding and abetting wicked deeds",
    "context": "When an individual or organization knowingly protects those who engage in unethical or illegal behavior, allowing such actions to continue without accountability. It refers to environments or systems that tolerate, hide, or enable wrongdoing, whether through negligence, complicity, or deliberate inaction. This often occurs in settings where moral integrity is compromised for personal gain or to maintain the status quo."
  },
  {
    "idiom": "盛极一时",
    "definition": "all the rage for a time; grand fashion for a limited time",
    "context": "When a trend, idea, or phenomenon gains immense popularity and dominance for a certain period before eventually fading, regardless of its origin or field. This often reflects how styles, technologies, or cultural movements rise to prominence rapidly but do not maintain long-term influence. It describes the natural cycle of peak popularity followed by decline in relevance or appeal."
  },
  {
    "idiom": "冥顽不灵",
    "definition": "pigheaded",
    "context": "When a person stubbornly refuses to consider new ideas, advice, or perspectives, showing no sign of flexibility or open-mindedness. It applies to situations where there is a complete lack of responsiveness to reason or persuasion, even when it leads to negative consequences. This often describes someone who is rigid in thinking and unwilling to adapt, no matter the circumstances."
  },
  {
    "idiom": "维妙维肖",
    "definition": "to imitate to perfection; to be remarkably true to life",
    "context": "When a representation, imitation, or portrayal captures every detail and essence of the original with extraordinary accuracy and lifelikeness. It is used to describe artistic, literary, or performative works that reflect the subject so realistically that they feel authentic or indistinguishable from the real thing."
  },
  {
    "idiom": "有条有理",
    "definition": "(idiom) clear and orderly;  neat and tidy",
    "context": "When a person presents information in a structured and logical way, making it easy to understand and follow. It can also describe a situation, system, or environment that is well-organized and arranged in a clear sequence. This often reflects a methodical and thoughtful approach to handling tasks or ideas."
  },
  {
    "idiom": "近亲繁殖",
    "definition": "inbreeding",
    "context": "When a group consistently promotes individuals or ideas from within a narrow, familiar circle without introducing outside perspectives or diversity, leading to stagnation or lack of fresh innovation. This often results in reduced adaptability and potential for growth due to the reinforcement of similar viewpoints and methods. It is commonly observed in organizations, families, or systems that prioritize internal loyalty over external merit or variety."
  },
  {
    "idiom": "蜻蜓点水",
    "definition": "lit. the dragonfly touches the water lightly; superficial contact (idiom)",
    "context": "Context generation failed"
  },
  {
    "idiom": "病入膏肓",
    "definition": "lit. the disease has attacked the vitals (idiom);  fig. beyond cure; the situation is hopeless",
    "context": "When a problem has advanced to a point where it is no longer possible to address or fix effectively, despite efforts or interventions. It refers to situations that have deteriorated to such an extent that recovery or improvement is unlikely. This often applies to conditions, systems, or circumstances that have been ignored or mishandled for too long."
  },
  {
    "idiom": "子子孙孙",
    "definition": "one's posterity",
    "context": "When referring to the continuation of a family lineage, traditions, or inherited values across multiple generations, especially in discussions about legacy, ancestry, or long-term responsibility. It often applies in contexts where the focus is on sustaining something through future generations, such as cultural practices, property, or family reputation. It can also be used to express hopes or concerns about what will be passed down and how it will endure over time."
  },
  {
    "idiom": "千钧一发",
    "definition": "a thousand pounds hangs by a thread (idiom); imminent peril; a matter of life or death",
    "context": "When a situation is on the verge of a critical failure or disaster, balanced precariously on a very fragile point. It refers to moments where the outcome is uncertain and the risk of a severe consequence is extremely high, often requiring immediate action to prevent catastrophe. It can describe any scenario where a small mistake or delay could lead to major negative results."
  },
  {
    "idiom": "韬光养晦",
    "definition": "to conceal one's strengths and bide one's time (idiom); to hide one's light under a bushel",
    "context": "When an individual or group deliberately avoids drawing attention to their abilities or achievements, often to remain unnoticed or to avoid conflict. This strategy is commonly used to preserve strength, avoid premature challenges, or wait for a more favorable moment to act or reveal one's capabilities. It reflects a calculated approach to staying low-profile in competitive or high-pressure environments."
  },
  {
    "idiom": "七嘴八舌",
    "definition": "lively discussion with everybody talking at once",
    "context": "When a group of people is engaged in an energetic and chaotic conversation where multiple individuals are speaking simultaneously, often without taking turns or allowing others to finish. This can occur in informal or heated discussions where everyone expresses their opinions at the same time, making it difficult to follow a single thread of thought. It typically reflects a lively, unstructured exchange rather than a calm or orderly dialogue."
  },
  {
    "idiom": "无以复加",
    "definition": "in the extreme (idiom); incapable of further increase",
    "context": "When a situation has reached the highest possible degree of intensity, severity, or completeness, to the point where no further increase or enhancement is possible. It describes circumstances or expressions that are already at their peak and cannot be made more extreme or pronounced."
  },
  {
    "idiom": "重温旧梦",
    "definition": "to revive old dreams (idiom);  to relive past experiences",
    "context": "Context generation failed"
  },
  {
    "idiom": "排山倒海",
    "definition": "lit. to topple the mountains and overturn the seas (idiom);  earth-shattering; fig. gigantic; of spectacular significance",
    "context": "When an overwhelming force or influence emerges, causing massive disruption or transformation, whether physical, emotional, or societal. It can describe a powerful movement, event, or sentiment that shakes the very foundation of existing structures or norms. The intensity is such that it leaves a deep, lasting impression due to its sheer scale and impact."
  },
  {
    "idiom": "天下太平",
    "definition": "the whole world at peace (idiom);  peace and prosperity",
    "context": "Context generation failed"
  },
  {
    "idiom": "理屈词穷",
    "definition": "lit. having presented a flawed argument, one has nothing further to add (idiom); fig. unable to provide a convincing argument to support one's position; to not have a leg to stand on",
    "context": "When an argument lacks logical foundation and fails to withstand scrutiny, leaving the person unable to defend their stance effectively. This often occurs in debates or discussions where evidence and reasoning are applied, exposing weaknesses in the original position. It describes a situation where further discussion becomes pointless due to the inability to provide credible support."
  },
  {
    "idiom": "应付自如",
    "definition": "to handle matters with ease (idiom); to hold one's own",
    "context": "When a person is able to manage various challenges or complex circumstances with confidence and skill, without appearing stressed or overwhelmed. This often occurs in scenarios where adaptability, quick thinking, and composure are essential for maintaining control or effectiveness. It can apply to professional, personal, or social situations where the individual successfully navigates pressures or demands."
  },
  {
    "idiom": "排忧解难",
    "definition": "to resolve a difficult situation and leave worries behind (idiom)",
    "context": "When individuals or groups actively work to remove obstacles and ease the burdens of others in challenging or distressing circumstances. This often involves providing support, finding solutions, and fostering a sense of relief in situations where problems seem overwhelming or intractable. It applies to any context where assistance is given to alleviate hardship and restore confidence or stability."
  },
  {
    "idiom": "操之过急",
    "definition": "to act with undue haste (idiom);  eager and impatient; overhasty",
    "context": "When someone acts without proper preparation or consideration, rushing into a task or decision before the right conditions are in place. This often leads to mistakes, frustration, or unintended consequences because the action is taken too quickly for the situation to handle effectively. It describes a pattern of impatience where progress is pursued at the expense of careful planning or natural timing."
  },
  {
    "idiom": "道貌岸然",
    "definition": "sanctimonious; dignified",
    "context": "When a person pretends to be morally superior or overly righteous in a way that feels insincere or exaggerated, often to impress others or justify their own behavior. This commonly occurs in situations involving public displays of virtue, authority, or judgment, where the intent seems more about appearance than genuine conviction."
  },
  {
    "idiom": "好逸恶劳",
    "definition": "to love ease and comfort and hate work (idiom)",
    "context": "When someone consistently avoids effort, prefers to remain in a state of comfort, and resists engaging in work or activities that require exertion, regardless of the long-term consequences. This often describes a pattern of behavior where ease and idleness are prioritized over responsibility or productivity. It can apply to individuals, groups, or even systems that shy away from challenges and hard work."
  },
  {
    "idiom": "因陋就简",
    "definition": "crude but simple methods (idiom);  use whatever methods you can; to do things simply and thriftily; It's not pretty but it works.",
    "context": "When resources are limited or circumstances are difficult, someone may adopt straightforward and practical approaches without concern for sophistication or appearance. This often involves making do with what is available, prioritizing functionality over refinement. It reflects a mindset focused on efficiency and economy, where effectiveness is valued even if the solution is not elegant."
  },
  {
    "idiom": "久而久之",
    "definition": "over time; as time passes; in the fullness of time",
    "context": "When a particular state, behavior, or condition continues for an extended period without significant change, it naturally becomes a long-standing or habitual aspect of the situation. This often leads to gradual effects or outcomes that may not be immediately noticeable but become evident as time progresses. It typically applies to processes or developments that unfold slowly and steadily over a long duration."
  },
  {
    "idiom": "自给自足",
    "definition": "self-sufficiency; autarky",
    "context": "When a group or individual has the ability to meet their own needs without relying on external support or resources, regardless of the domain—be it economic, agricultural, or personal. This often reflects a state of independence, sustainability, or self-reliance where external dependencies are minimized or eliminated. It is commonly used in contexts emphasizing resilience, autonomy, or the capacity to function effectively on one's own terms."
  },
  {
    "idiom": "摇身一变",
    "definition": "to change shape in a single shake; fig. to take on a new lease of life",
    "context": "When an individual or entity undergoes a sudden and dramatic transformation, shedding previous characteristics or roles to adopt a completely different identity or approach. This often implies a quick and effortless shift, usually toward a more advantageous or elevated position. It applies to scenarios where reinvention or a strategic change in image, function, or status occurs swiftly and with apparent ease."
  },
  {
    "idiom": "未能免俗",
    "definition": "unable to break the custom (idiom); bound by conventions",
    "context": "When a person or group continues to follow traditional or widely accepted behaviors, even when they recognize the limitations or drawbacks, simply because it is familiar or expected. This often happens when there is a lack of motivation, fear of deviation, or pressure from social norms to conform. It reflects a state of being constrained by convention rather than making independent choices."
  },
  {
    "idiom": "害群之马",
    "definition": "lit. a horse that brings trouble to its herd (idiom); fig. troublemaker; black sheep; rotten apple",
    "context": "When an individual or element within a group consistently causes harm, disruption, or negative consequences for the rest of the collective, despite efforts to maintain harmony or progress. This often refers to someone whose actions or presence undermine the reputation, effectiveness, or well-being of the entire group. It emphasizes the damaging influence of one bad component that affects the whole."
  },
  {
    "idiom": "死去活来",
    "definition": "to hover between life and death (idiom); to suffer terribly; within an inch of one's life",
    "context": "This expression applies to situations where someone endures extreme pain, hardship, or near-catastrophic experiences, often to the point of feeling as though they are barely surviving. It can describe physical suffering, intense emotional distress, or overwhelming challenges that push a person to their absolute limit. The pattern typically involves a struggle so severe that recovery or relief feels uncertain or miraculous."
  }
]